Revit 2027 API
AnalysisResultSchema.GetUnitsMultiplier Method
 returns units multiplier by index
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetUnitsMultiplier(
	int index
)
Public Function GetUnitsMultiplier (
	index As Integer
) As Double
public:
double GetUnitsMultiplier(
	int index
)
member GetUnitsMultiplier :
        index : int -> float
Parameters
index Int32
 index of unit in the list
Return Value
Double
See Also
Reference
AnalysisResultSchema Class
Autodesk.Revit.DB.Analysis Namespace